Repository: EugenioTesio/portfolio
Catalog: lib/src/localization/app_*.arb
Languages: es

# homeSectionTitle
source: Home
es: Inicio

# aboutSectionTitle
source: About
es: Acerca de

# aboutSectionTitleAlt
source: About Me
es: Sobre mí

# experienceSectionTitle
source: Experience
es: Experiencia

# projectsSectionTitle
source: Projects
es: Proyectos

# englishLanguage
source: English
es: Inglés

# spanishLanguage
source: French
es: Español

source: Resume
es: Currículum

source: Download resume
es: Descargar currículum

# resumePresent
source: Present
es: Actual

# description
source: Passionate Software Developer
es: Desarrollador de software apasionado

# subDescription
source: Senior Flutter and Python Enthusiast
es: Entusiasta senior de Flutter y Python

# about
source: Hello! I'm Eugenio Tesio, highly experienced Flutter Developer with 5+ year's expertise in designing and developing comprehensive applications using Java, Spring Boot, Python, and the Flutter framework. Skilled in leveraging powerful architecture patterns to create impressive software products that meet customer needs. Passionate about creating impactful solutions by optimizing complex technical solutions for businesses to achieve their objectives. Looking for innovative Python/Flutter projects where I can combine my strongest knowledge.
es: ¡Hola! Soy Eugenio Tesio, un desarrollador de Flutter altamente experimentado con más de 5 años de experiencia en el diseño y desarrollo de aplicaciones completas utilizando Java, Spring Boot, Python y el framework Flutter. Hábil en el aprovechamiento de patrones de arquitectura poderosos para crear productos de software impresionantes que satisfacen las necesidades del cliente. Apasionado por crear soluciones de alto impacto optimizando soluciones técnicas complejas para que las empresas alcancen sus objetivos. Buscando proyectos innovadores de Python/Flutter donde pueda combinar mis conocimientos más fuertes.

# portfolioDescription
source: Yes, it's THIS portfolio! This project follows a Riverpod-based Architecture, using a feature-first approach for its structure. It is fully responsive, and supports multiple themes and languages.
es: ¡Sí, es ESTE portafolio! Este proyecto sigue una arquitectura basada en Riverpod, utilizando un enfoque de características para su estructura. Es completamente receptivo y admite múltiples temas e idiomas.

# credit
source: Design inspired by
es: Diseño inspirado en

# pairtreeDevJobTitle
source: Full Stack Developer
es: Desarrollador Full Stack

# pairtreeDevJobDescription
source: <ul> <li>Developed applications using Flutter and BLoC architecture.</li> <li>Used GitHub Actions for testing and deployment.</li> <li>Performed unit, widget, and integration testing.</li> <li>Implemented golden testing for UI development.</li> <li>Assisted in Python backend development using FastAPI.</li> <li>Utilized SQLAlchemy and Alembic migrations for database operations.</li> <li>Achieved 100% code coverage for all tests in Python Backend.</li> <li>Utilized fixtures to create test data for functional and regression tests.</li> <li>Modified existing test cases to improve coverage and accuracy.</li> <li>Worked with developers to troubleshoot and resolve software issues.</li> <li>Developed and improved CI/CD pipelines.</li> <li>Identified and tracked issues with Sentry.</li> </ul>
es: <ul> <li>Desarrolló aplicaciones utilizando Flutter y la arquitectura BLoC.</li> <li>Utilizó GitHub Actions para pruebas y implementación.</li> <li>Realizó pruebas unitarias, de widgets e integración.</li> <li>Implementó pruebas doradas para el desarrollo de la interfaz de usuario.</li> <li>Ayudó en el desarrollo de backend de Python utilizando FastAPI.</li> <li>Utilizó SQLAlchemy y migraciones de Alembic para operaciones de base de datos.</li> <li>Logró una cobertura de código del 100% para todas las pruebas en Python Backend.</li> <li>Utilizó accesorios para crear datos de prueba para pruebas funcionales y de regresión.</li> <li>Modificó casos de prueba existentes para mejorar la cobertura y precisión.</li> <li>Trabajó con desarrolladores para solucionar y resolver problemas de software.</li> <li>Desarrolló y mejoró tuberías de CI/CD.</li> <li>Identificó y rastreó problemas con Sentry.</li> </ul>

# tandamosDevJobTitle
source: Full Stack Developer
es: Desarrollador Full Stack

# tandamosDevJobDescription
source: <ul> <li>Developed a customer-facing mobile application using Flutter.</li> <li>Enhanced existing backend services built with Next.js using TypeScript.</li> <li>Developed a TypeORM framework to manage data access from a MySQL database.</li> <li>Utilized the Riverpod state management library to store and manage application state.</li> <li>Developed custom reusable UI components using Flutter.</li> <li>Developed automated unit, widget, and integration tests to ensure application stability.</li> <li>Developed reusable functions in Node.js to reduce code redundancy.</li> <li>Utilized Firebase for authentication, authorization, and data synchronization.</li> </ul>
es: <ul> <li>Desarrolló una aplicación móvil para clientes utilizando Flutter.</li> <li>Mejoró los servicios backend existentes construidos con Next.js utilizando TypeScript.</li> <li>Desarrolló un marco TypeORM para administrar el acceso a datos desde una base de datos MySQL.</li> <li>Utilizó la biblioteca de gestión de estado Riverpod para almacenar y administrar el estado de la aplicación.</li> <li>Desarrolló componentes de IU personalizados reutilizables utilizando Flutter.</li> <li>Desarrolló pruebas unitarias, de widgets e integración automatizadas para garantizar la estabilidad de la aplicación.</li> <li>Desarrolló funciones reutilizables en Node.js para reducir la redundancia de código.</li> <li>Utilizó Firebase para la autenticación, autorización y sincronización de datos.</li> </ul>

# valtechDevJobTitle
source: Backend Developer
es: Desarrollador Backend

# valtechDevJobDescription
source: <ul> <li>Developed a Java Spring Boot app that allowed other internal services to send emails using Google Pub/Sub</li> <li>The service used Oracle Responsys to enable the delivery of emails Improved reliability and scalability of the email delivery system.</li> <li>Created unit and integration tests to ensure the app met the requirements.</li> <li>Investigated and resolved any bugs or errors encountered</li> <li>Developed RESTful APIs to enable the app to communicate with other services.</li> <li>Collaborated with other developers and stakeholders to ensure success.</li> <li>Managed the development of the app through its full life cycle.</li> <li>Identified and deployed new tools to improve the app functionality.</li> <li>Resolved conflicts between the app and third-party services.</li> </ul>
es: <ul> <li>Desarrolló una aplicación Java Spring Boot que permitió a otros servicios internos enviar correos electrónicos utilizando Google Pub/Sub</li> <li>El servicio utilizó Oracle Responsys para habilitar la entrega de correos electrónicos Mejoró la confiabilidad y escalabilidad del sistema de entrega de correos electrónicos.</li> <li>Creó pruebas unitarias e integración para garantizar que la aplicación cumpliera con los requisitos.</li> <li>Investigó y resolvió cualquier error o problema encontrado</li> <li>Desarrolló APIs RESTful para permitir que la aplicación se comunique con otros servicios.</li> <li>Colaboró con otros desarrolladores y partes interesadas para garantizar el éxito.</li> <li>Administró el desarrollo de la aplicación a través de todo su ciclo de vida.</li> <li>Identificó e implementó nuevas herramientas para mejorar la funcionalidad de la aplicación.</li> <li>Resolvió conflictos entre la aplicación y servicios de terceros.</li> </ul>

# freelanceDevJobTitle
source: Full Stack Developer
es: Desarrollador Full Stack

# freelanceDevJobDescription
source: <ul> <li> Worked on web and mobile applications using Flutter with State Management such as Provider, BloC, Riverpod, GetX. Unit Test, Widget test, Golden test, and integration test. </li> <li>Developed software applications with Java using SpringBoot implementing Spring Web, Hibernate, Spring Data JPA, Spring Security, OAuth2 Client, Spring JDBC, Spring. Data MongoDB, WebSockets, Spring Messaging, Scheduler, Spring Cache, Spring Boot Actuator, Swagger, GCP Storage, and GCP Messaging.</li> <li>Developed Python back-end components using Flask or FastAPI, WebSockets, SqlAlchemy, and REST API with Asyncio coroutine manager, Base Model (pydantic)</li> <li>Developed automatic&nbsp;database migration in Python backends&nbsp;with Alembic from SqlAlchemy.</li> <li>Deployed mobile applications in Google PlayStore and AppStore without being rejected.</li> <li>Performed DevOps operations in Google Cloud such as CI/CD using Cloud Run, Cloud App Engine Flexible Environment, Cloud Build, Cloud Artifacts</li> <li>Worked on modularization, creating multiple packages.</li> <li>Worked with Firebase as a back-end platform, and with Google and Facebook for authentication</li> <li>Worked with Firestore NoSQL database, Google Storage, Google Functions, Google Pub/Sub, and Remote Config.</li> <li>Performed Firebase full-text search Elastic Search.</li> <li>Used Google Analytics, Crashlytics, and Sentry for bugs and metrics follow-up.</li> <li>Worked with OCPP 1.6 (Open Charge Point Protocol), the vehicle electrical charger connection protocol.</li> <li>Monitored ongoing operation of assigned programs and responded to problems by diagnosing and correcting logic and coding errors.</li> <li>Discussed project progress with customers, collected feedback on different stages, and directly addressed concerns.</li> <li>Gathered and defined customer requirements to develop clear specifications for project plans</li> <li>Orchestrated efficient large-scale software deployments, including testing features and correcting code.</li> <li>Designed and documented systems based on the results of the analysis.</li> <li>Developed databases, programs, and processes for integration and implementation across the enterprise.</li> <li>Trained new developers and programmers on company standards for design and review.</li> <li>Reviewed user requirements, analyzed, designed, implemented, installed, and delivered training for new applications.</li> </ul>
es: <ul> <li>Trabajó en aplicaciones web y móviles utilizando Flutter con gestión de estado como Provider, BloC, Riverpod, GetX. Prueba unitaria, prueba de widget, prueba dorada y prueba de integración. </li> <li>Desarrolló aplicaciones de software con Java utilizando SpringBoot implementando Spring Web, Hibernate, Spring Data JPA, Spring Security, OAuth2 Client, Spring JDBC, Spring. Data MongoDB, WebSockets, Spring Messaging, Scheduler, Spring Cache, Spring Boot Actuator, Swagger, GCP Storage y GCP Messaging.</li> <li>Desarrolló componentes de backend de Python utilizando Flask o FastAPI, WebSockets, SqlAlchemy y REST API con el administrador de coroutine Asyncio, Base Model (pydantic)</li> <li>Desarrolló migración automática de base de datos en backends de Python con Alembic de SqlAlchemy.</li> <li>Implementó aplicaciones móviles en Google PlayStore y AppStore sin ser rechazado.</li> <li>Realizó operaciones de DevOps en Google Cloud, como CI/CD utilizando Cloud Run, Cloud App Engine Flexible Environment, Cloud Build, Cloud Artifacts</li> <li>Trabajó en modularización, creando múltiples paquetes.</li> <li>Trabajó con Firebase como plataforma de backend y con Google y Facebook para la autenticación</li> <li>Trabajó con la base de datos NoSQL Firestore, Google Storage, Google Functions, Google Pub/Sub y Remote Config.</li> <li>Realizó búsquedas de texto completo de Firebase Elastic Search.</li> <li>Utilizó Google Analytics, Crashlytics y Sentry para el seguimiento de errores y métricas.</li> <li>Trabajó con OCPP 1.6 (Protocolo de punto de carga abierto), el protocolo de conexión de cargador eléctrico del vehículo.</li> <li>Monitoreó la operación continua de los programas asignados y respondió a los problemas diagnosticando y corrigiendo errores de lógica y codificación.</li> <li>Discutió el progreso del proyecto con los clientes, recopiló comentarios en diferentes etapas y abordó directamente las preocupaciones.</li> <li>Reunió y definió los requisitos del cliente para desarrollar especificaciones claras para los planes del proyecto</li> <li>Orquestó implementaciones de software a gran escala eficientes, incluyendo la prueba de características y la corrección de código.</li> <li>Diseñó y documentó sistemas basados en los resultados del análisis.</li> <li>Desarrolló bases de datos, programas y procesos para la integración e implementación en toda la empresa.</li> <li>Capacitó a nuevos desarrolladores y programadores en los estándares de diseño y revisión de la empresa.</li> <li>Revisó los requisitos del usuario, analizó, diseñó, implementó, instaló y entregó capacitación para nuevas aplicaciones.</li> </ul>

# vulleticProjectDescription
source: The purpose of the solution built is to integrate Electric Vehicle Charger with an online platform that manages them. The mobile application built in Flutter with GetX as the state management package connects the users with the Electric Vehicle Charger in order to charge their vehicles allowing them to pay through the platform. The web application built in Nuxt allows the Electric Vehicle Charger owner to manage them and get all the information they need. The chargers are connected in real-time using WebSocket connection with the backend built in Python. The platform and the mobile app was developed for the company Vulletic, which is the electrical vehicles chargers provider.
es: El propósito de la solución construida es integrar el cargador de vehículos eléctricos con una plataforma en línea que los administre. La aplicación móvil construida en Flutter con GetX como paquete de gestión de estado conecta a los usuarios con el cargador de vehículos eléctricos para cargar sus vehículos permitiéndoles pagar a través de la plataforma. La aplicación web construida en Nuxt permite al propietario del cargador de vehículos eléctricos administrarlos y obtener toda la información que necesitan. Los cargadores están conectados en tiempo real utilizando una conexión WebSocket con el backend construido en Python. La plataforma y la aplicación móvil fueron desarrolladas para la empresa Vulletic, que es el proveedor de cargadores de vehículos eléctricos.

# collectioProjectDescriptionHtml
source: The purpose of the application is to facilitate monthly membership collection. It was builded thinking on how to help associations and clubs that collect the monthly membership manually with a collector person. With this application they can automate invoice delivery, remind users about which ones are still pending and help the collector to not miss anyone or repeat someone. The application is built in Flutter with the GetX framework. It uses Firebase as the authentication platform and Firestore as the real-time database
es: El propósito de la aplicación es facilitar la recolección mensual de membresía. Se construyó pensando en cómo ayudar a asociaciones y clubes que recolectan la membresía mensualmente manualmente con una persona recolectora. Con esta aplicación, pueden automatizar la entrega de facturas, recordar a los usuarios sobre cuáles están pendientes y ayudar al recolector a no perder a nadie o repetir a alguien. La aplicación está construida en Flutter con el marco GetX. Utiliza Firebase como plataforma de autenticación y Firestore como base de datos en tiempo real
